"""
На предприятии каждой изготовленной детали присваивают серийный номер из 225 символов.
Для хранения каждого номера отведено одинаковое и минимально возможное число байт; используется посимвольное кодирование – все символы кодируются одинаковым и
минимально возможным числом бит. Известно, что для хранения 1270 серийных номеров
отведено не более 104 Кбайт памяти.
Определите максимально возможную мощность алфавита, используемого для записи серийных номеров.

Ответ:
"""

from math import floor

from math import floor

memory = 104 * 1024  # в байтах
memory_per_user = memory / 1270 * 8  # в битах

i = floor(memory_per_user / 225)  # бит на 1 символ

print(2 ** i)  # мощность алфавита
