"""
На предприятии каждой изготовленной детали присваивают серийный номер, состоящий из
199 символов. В базе данных каждый серийный номер занимает одинаковое и минимально
возможное целое число байт. При этом используется посимвольное кодирование серийных
номеров, все символы кодируются одинаковым и минимально возможным числом бит. Известно, что для хранения 257 384 серийных номеров отведено не более 74 Мбайт памяти.
Определите максимально возможную мощность алфавита, используемого для записи серийных номеров. В ответе запишите только целое число.

"""

memoru_for_one_serial = (74 * 1024 * 1024  * 8) / 257384 # bit
i = int(memoru_for_one_serial / 199)
print(2 ** i)
