"""
Сеть задана IP-адресом одного из входящих в неё узлов 102.162.200.51 и сетевой маской
255.255.255.0.
Найдите в данной сети наибольший IP-адрес, который может быть назначен компьютеру. В
ответе укажите сумму числовых значений октетов найденного IP-адреса.
Например, если бы найденный адрес был равен 100.20.3.4, то в ответе следовало бы записать: 127.
Ответ:
"""

from ipaddress import ip_network
# 102.162.200.0 адрес сети
# 102.162.200.255 широковежательный адрес в сети

ip = ip_network('102.162.200.51/255.255.255.0', strict=0)
print(ip[-1]) # 102.162.200.255 нам не подходит так как он широковещательный
print(sum(map(int, str(ip[-2]).split('.'))))
