"""
Операнды арифметического выражения записаны в системе счисления с основанием 22.
63x89875^22 + 17x51^^ + 75x3^22
В записи чисел переменной x обозначена неизвестная цифра из алфавита 22-ричной системы счисления.
Определите наибольшее значение x, при котором значение данного арифметического выражения кратно 21. Для найденного значения x вычислите частное от деления
значения арифметического выражения на 21 и укажите его в ответе в десятичной системе
счисления. Основание системы счисления указывать не нужно.
Ответ: 733155579
"""
all_x = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 'A', 'В', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L'][::-1]

for x in all_x:
    answer = int(f'63{x}89875', 22) + int(f'17{x}51', 22) + int(f'75{x}3', 22)
    if answer % 21 == 0:
        print(answer // 21)
        break
