"""
Значение арифметического выражения
5**150 + 5**100 − x,
где x – целое положительное число, меньшее 2030, записали в пятеричной системе счисления. Определите наименьшее значение x, при котором количество нулей в пятеричной
записи числа, являющегося значением данного арифметического выражения, максимально.
В ответе запишите число в десятичной системе счисления.
"""

x_zeros = {0: 0}

for x in range(1, 2030):

    answer = 5**150 + 5**100 - x  # нашли значение арифметического выражения

    ost = ''
    while answer > 0:
        ost += str(answer % 5)
        answer = answer // 5

    x_zeros[x] = ost.count('0')  # в словарик x_zeros добавим {x: количество нулей в пятеричной записи}

zeros = []
for zero in x_zeros.values(): # получим список с количеством всех нулей
    zeros.append(zero)

max_zeros = max(zeros)

all_x = []
for x, zeros in x_zeros.items(): # получим x и количество нулей для этого икса
    if zeros == max_zeros:
        all_x.append(x)

print(min(all_x))
