"""
Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на
натуральное число m». Задан отрезок B = [15; 30]. Для какого наибольшего натурального
числа A формула
ДЕЛ(x, A) ∨ (ДЕЛ(x, 23) → ¬(x ∈ B))
тождественно истинна (т.е. принимает значение 1) при любом натуральном значении переменной x?
"""

B = list(range(15, 31))

for A in range(10000, 0, -1):
    for x in range(1000):
        if not((x % A == 0) or ((x % 23 == 0) <= (x not in B)) ):
            break
    else:
        print(A)
        break
