"""
На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом.

1. Строится двоичная запись числа N.
2. К этой записи дописываются справа ещё два разряда по следующему правилу:
а) складываются все цифры двоичной записи, и остаток от деления суммы на 2 дописывается в конец числа (справа).

Например, запись 11100 преобразуется в запись 111001
б) над этой записью производятся те же действия — справа дописывается остаток от деления суммы цифр на 2.

Полученная таким образом запись (в ней на два разряда больше, чем в записи исходного числа N) является двоичной записью искомого числа R.
Укажите минимальное число R, которое превышает 43 и может являться результатом работы алгоритма. В ответе это число запишите в десятичной системе.

Ответ 46
"""
all_r = [] # пустой список

for n in range(1, 101): # генерируем числа от 1 до 100
    n_bin = bin(n)[2:] # переводим в 2 систему и убираем префикс 0b вначале

    for _ in range(2): # повторяем 2 раза
        n_bin += str(sum(list(map(int, list(n_bin)))) % 2) # '101' -> ['1', '0', '1'] -> [1, 0, 1] -> 2 % 2 -> 0 -> '0'

    r = int(n_bin, 2) # '101010'-> 23 переводим из двоичной в 10ю
    all_r.append(r)  # .append() добавляем в конец списка

all_r.sort()
print(all_r)
